In [1]:
import ulid

In [2]:
id = ulid.new()
id

In [3]:
id.str

'01HY0Y2PGNM8544X866SFFBQ72'

In [4]:
id.timestamp()

In [5]:
id.timestamp().datetime

datetime.datetime(2024, 5, 16, 14, 49, 40, 629000, tzinfo=datetime.timezone.utc)

In [6]:
import pandas as pd
from ulid import ULID

In [7]:
data = {
    'name': ['Alice', 'Bob','Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'London', 'Paris', 'Tokyo'],
}

df = pd.DataFrame(data)
df

      name  age      city
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo

In [16]:
import pandas as pd
import ulid

# サンプルデータフレームの作成
data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
        'age': [25, 30, 35, 40],
        'city': ['New York', 'London', 'Paris', 'Tokyo']}
df = pd.DataFrame(data)

# 新しい列'ulid'を追加し、各行に異なるulidを割り当てる
df['ulid'] = [str(ulid.new()) for _ in range(len(df))]

print(df)

      name  age      city                        ulid
0    Alice   25  New York  01HY0ZSSZ6B3H887BXPZR5B939
1      Bob   30    London  01HY0ZSSZ6AZJPBC8BXVGQ32FF
2  Charlie   35     Paris  01HY0ZSSZ6N8VZFZA4SN6FH7D6
3    David   40     Tokyo  01HY0ZSSZ6PZ9YXQ7R9DBWV2FP

In [17]:
import pandas as pd
import ulid

# サンプルデータフレームの作成
data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
        'age': [25, 30, 35, 40],
        'city': ['New York', 'London', 'Paris', 'Tokyo']}
df = pd.DataFrame(data)

df.insert(0, 'ulid', [str(ulid.new()) for _ in range(len(df))])

In [18]:
df

                         ulid     name  age      city
0  01HY0ZTVGX4TNT8JTSM452250N    Alice   25  New York
1  01HY0ZTVGX0H9RY7K6SJH739AX      Bob   30    London
2  01HY0ZTVGX2PRN8GGCEV6A9NS9  Charlie   35     Paris
3  01HY0ZTVGXW1QQYDC3BBWE5Z5Z    David   40     Tokyo

In [19]:
import pandas as pd
import ulid

# サンプルデータフレームの作成
data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
        'age': [25, 30, 35, 40],
        'city': ['New York', 'London', 'Paris', 'Tokyo']}
df = pd.DataFrame(data)

df.insert(0, 'ulid', df.apply(lambda _ : str(ulid.new()), axis=1))

In [20]:
df

                         ulid     name  age      city
0  01HY10008B036DTHF3X8ARSY44    Alice   25  New York
1  01HY10008BSJ1H09CKF9YGRZPF      Bob   30    London
2  01HY10008BRM9ZNNETF73R03YR  Charlie   35     Paris
3  01HY10008BM3JZY6VTH99Y38Q6    David   40     Tokyo

In [1]:
import pandas as pd
import ulid

# サンプルデータフレームの作成
data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
        'age': [25, 30, 35, 40],
        'city': ['New York', 'London', 'Paris', 'Tokyo']}
df = pd.DataFrame(data)

df.insert(0, 'ulid', [str(ulid.new()) for _ in df.index])

In [2]:
df

                         ulid     name  age      city
0  01J3ANTVDZNJVAHXRM8NXTKNK4    Alice   25  New York
1  01J3ANTVDZXCRAAD5PYP2RXKJ8      Bob   30    London
2  01J3ANTVDZ5KJMJXDGTMVGZ9QA  Charlie   35     Paris
3  01J3ANTVDZY9EFST114B2X2X1H    David   40     Tokyo